app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $userModel = new UserModel();
        $user = $userModel->find($session->get('id'));