app/Controllers/Auth.php

    public function loginProcess()
    {
        $request = service('request');
        $model = new UserModel();

        $rules = [
            'username_or_email' => 'required|min_length[3]',
            'password'          => 'required|min_length[8]',
        ];

        if (!$this->validate($rules)) {
            $this->session->setFlashdata('errors', $this->validator->getErrors());
            $this->session->setFlashdata('old_input', $request->getPost());
            return redirect()->back()->withInput();
        }

        $usernameOrEmail = $request->getPost('username_or_email');
        $password        = $request->getPost('password');

        $user = $model->where('username', $usernameOrEmail)
                      ->orWhere('email', $usernameOrEmail)
                      ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1