app/Controllers/Buku.php

    public function index()
    {
        $request = service('request');
        $session = session();

        $searchQuery = $request->getGet('q');
        $perPage = 10;
        $currentPage = $request->getGet('page') ?? 1;

        $userRole = $session->get('role');
        $userId = $session->get('id');

        $buku = [];
        $totalRows = 0;


        if ($userRole === 'admin') {
            $totalRows = $this->bukuModel->countAllBuku($searchQuery);
            $buku = $this->bukuModel->getBuku($perPage, ($currentPage - 1) * $perPage, $searchQuery);
        } else {

            $adminUser = $this->userModel->where('role', 'admin')->first();
---
SELECT *
FROM `users`
WHERE `role` = 'admin'
 LIMIT 1