app/Models/BukuModel.php

    public function getBuku($limit = 10, $offset = 0, $searchQuery = null)
    {
        $builder = $this->builder();
        if ($searchQuery) {
            $builder->groupStart()
                    ->like('judul', $searchQuery)
                    ->orLike('penulis', $searchQuery)
                    ->orLike('penerbit', $searchQuery)
                    ->groupEnd();
        }
        $builder->limit($limit, $offset);
        return $builder->get()->getResultObject();
---
SELECT *
FROM `buku`
 LIMIT 10

    public function countAllBuku($searchQuery = null)
    {
        $builder = $this->builder();
        if ($searchQuery) {
            $builder->groupStart()
                    ->like('judul', $searchQuery)
                    ->orLike('penulis', $searchQuery)
                    ->orLike('penerbit', $searchQuery)
                    ->groupEnd();
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`

    public function getBukuByUserId($userId, $limit = 10, $offset = 0, $searchQuery = null)
    {
        $builder = $this->builder();
        $builder->where('user_id', $userId);
        if ($searchQuery) {
            $builder->groupStart()
                    ->like('judul', $searchQuery)
                    ->orLike('penulis', $searchQuery)
                    ->orLike('penerbit', $searchQuery)
                    ->groupEnd();
        }
        $builder->limit($limit, $offset);
        return $builder->get()->getResultObject();
---
SELECT *
FROM `buku`
WHERE `user_id` = '1'
 LIMIT 10

    public function countAllBukuByUserId($userId, $searchQuery = null)
    {
        $builder = $this->builder();
        $builder->where('user_id', $userId);
        if ($searchQuery) {
            $builder->groupStart()
                    ->like('judul', $searchQuery)
                    ->orLike('penulis', $searchQuery)
                    ->orLike('penerbit', $searchQuery)
                    ->groupEnd();
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
WHERE `user_id` = '1'